app/Helpers/Helper.php

select * from `menus` where `status` = '1'
---
    public static function menu() {
        $menus = Menu::where('status','1')
            ->get();

select * from `tour_prices` inner join `traveler_types` on `traveler_types`.`id` = `tour_prices`.`traveler_type_id` where `tour_id` = 1 order by `price` asc
---
    public static function tourDetails($id) {
        $tourDetails = Tour::with('tourPrice')->find($id);

select `name` from `cms_users` where `id` = 1 limit 1
---
    public static function userDetail($user_id) {
        $user = User::select('name')
            ->where('id',$user_id)
            ->first();

select * from `tour_prices` inner join `traveler_types` on `traveler_types`.`id` = `tour_prices`.`traveler_type_id` where `tour_id` = 1 order by `price` asc
---
    public static function tourPrice($id) {
        $tourPrice = TourPrice::join('traveler_types','traveler_types.id','tour_prices.traveler_type_id')
            ->where('tour_id',$id)
            ->orderBy('price','ASC')
            ->get();

select count(id) as total_search, page_url from `user_logs` where `page_url` like '%search%' or `page_url` like '%location%' or `page_url` like '%attractions%' group by `page_url` order by `total_search` desc limit 10
---
    public static function searchResult() {
        $populerSearch = UserLog::select(DB::raw('count(id) as total_search, page_url'))
            ->where('page_url','like','%search%')
            ->orWhere('page_url','like','%location%')
            ->orWhere('page_url','like','%attractions%')
            ->groupBy('page_url')
            ->orderBy('total_search','DESC')
            ->take(10)
            ->get();

select count(id) as total_search, page_url from `user_logs` where `page_url` like '%location%' group by `page_url` order by `total_search` desc limit 10
---
    public static function featureTour() {
        $featuredTours = UserLog::select(DB::raw('count(id) as total_search, page_url'))
            ->where('page_url','like','%location%')
            ->groupBy('page_url')
            ->orderBy('total_search','DESC')
            ->take(10)
            ->get();

select `rating`, `id` from `reviews` where `tour_id` = 1
---
    public static function review($tour_id) {
        $reviews = Review::where('tour_id',$tour_id)
                    ->pluck('rating','id')
                    ->toArray();

select * from `wishlists` where `user_id` is null and `tour_id` = 1
---
    public static function showWishlist($tour_id) {
      $wishlist = Wishlist::where('user_id',Auth::user()->id)
      ->where('tour_id',$tour_id)
      ->get();

select * from `blog_categories` where `id` = 3 limit 1
---
    public static function blogCategory($categoryId){
       $categpry = BlogCategory::where('id',$categoryId)->first();