app/Http/Controllers/AdminAjaxController.php

    public function getProvince() {
        $country_id = $_GET['country_id'];
        $provinceList = Region::where('country_id',$country_id)->pluck('name','id');
---
select `name`, `id` from `regions` where `country_id` = '96'