app/Http/Controllers/AdminToursController.php

select `category_name`, `id` from `tour_categories`
select `name`, `id` from `countries`
---
        public function getAdd()
        {
            if(!CRUDBooster::isCreate() && $this->global_privilege==FALSE || $this->button_add==FALSE) {
                CRUDBooster::redirect(CRUDBooster::adminPath(),trans("crudbooster.denied_access"));
            }
            $data['page_title'] = "Add Tour";
            $data['categories'] = TourCategory::pluck('category_name','id');
            $data['countries'] = Country::pluck('name','id');