app/Http/Controllers/AjaxController.php

    public function searchResult(Request $request) {

        $tourLocation = Tour::where('location','like',"%".$request->keyword."%")
            ->groupBy('location')
            ->get();

        $tourtitle = Tour::join('tour_prices','tours.id','tour_prices.tour_id')
            ->where('title','like',"%".$request->keyword."%")
            ->groupBy('tours.id')
            ->get();

        $tourAttractions = Tour::where('attractions','like',"%".$request->keyword."%")
            ->groupBy('attractions')
            ->get();
---
select * from `tours` where `location` like '%ni%' group by `location`
select * from `tours` inner join `tour_prices` on `tours`.`id` = `tour_prices`.`tour_id` where `title` like '%listin%'
select * from `tours` where `attractions` like '%listin%'

         $userLog->browser = Browser::browserFamily();
         $userLog->browser_version = Browser::browserVersion();
         $userLog->client_time = $_GET['client_time'];
         $userLog->save();
---
insert into `user_logs` (`user_id`, `session_id`, `log_type`, `page_url`, `ip_address`, `country`, `city`, `isp`, `platefrom`, `os`, `browser`, `browser_version`, `client_time`, `updated_at`, `created_at`) values ('0', '0000000', '1', '/booktours/', '27.97.11.130', 'IN', 'Lucknow', '---', 'Desktop', 'Windows 10', 'Chrome', '74.0.3729', 'Tue May 28 2019 16:59:22 GMT+0530 (India Standard Time)', '2019-05-28 11:29:24', '2019-05-28 11:29:24')