app/Http/Controllers/BlogController.php

select * from `blog_categories` where `status` = 1
select * from `blogs` where `status` = '1' group by `category_id` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `blogs` where `status` = '1' group by `category_id`
select * from `blogs` where `status` = '1' order by `id` desc limit 5
---
    public function index() {
        $categories = BlogCategory::where('status',1)->get();
        $blogs = Blog::where('status','1')
            ->orderBy('created_at','desc')
            ->groupBy('category_id')
            ->paginate('5');
        $mostpopular = Blog::where('status','1')
            ->orderBy('id','desc')
            ->take(5)
            ->get();