app/Http/Controllers/TourController.php

    public function index() {

        $ip = \Request::ip();;
        $position = Location::get($ip);

        $countryId = Country::where('code',$position->countryCode)
            ->first();
        $categories = Tour::select(DB::raw('count(tours.id) as total_tours,tour_categories.category_name'))
            ->join('tour_categories','tour_categories.id','tours.category_id')
            ->groupBy('tours.category_id','tour_categories.category_name')
            ->get();

        $tours = Tour::with('tourImages')
            ->where('country',$countryId->id)
            ->orderBy('visit','DESC')
            ->take(4)
            ->get();

        $remainingTours = 4 - count($tours);
        if(count($tours)<4) {
            $tours = Tour::with('tourImages')
                ->orderBy('visit','DESC')
                ->take($remainingTours)
                ->get();
        }

        $popularDestinations = PopularDestination::where('status',1)
            ->orderBy('position','ASC')
            ->get();
---
select * from `countries` where `code` is null limit 1
select count(tours.id) as total_tours,tour_categories.category_name from `tours` inner join `tour_categories` on `tour_categories`.`id` = `tours`.`category_id` group by `tours`.`category_id`, `tour_categories`.`category_name`
select * from `tour_categories` where `tour_categories`.`id` in ('1')
select * from `tours` where `country` is null order by `visit` desc limit 4
select * from `tours` order by `visit` desc limit 4
select * from `popular_destinations` where `status` = 1 order by `position` asc

    public function detailTour($slug) {
        $tour = Tour::with('category','tourImages','reviews')
            ->where('slug',$slug)
            ->first();
---
select * from `reviews` where `reviews`.`tour_id` in (1)
select * from `tour_categories` where `tour_categories`.`id` in (1)
select * from `tours` where `slug` = 'toronto-to-niagara-falls-day-tour1' limit 1

    public function tours()  {

        $order = $_GET['order'];

        $search = urldecode($_GET['search']);

        $categories = Tour::select(DB::raw('count(tours.id) as total_tours,tour_categories.category_name'))
            ->join('tour_categories','tour_categories.id','tours.category_id')
            ->groupBy('tours.category_id','tour_categories.category_name')
            ->get();
---
select count(tours.id) as total_tours,tour_categories.category_name from `tours` inner join `tour_categories` on `tour_categories`.`id` = `tours`.`category_id` group by `tours`.`category_id`, `tour_categories`.`category_name`

    public function category($any) {

        $order = $_GET['order'];
        $category = urldecode($any);
        $catId = TourCategory::select('id','category_name')
            ->where('category_name','like',$category)
            ->first();
        $categoryName = $catId->category_name;
        $categories = Tour::select(DB::raw('count(tours.id) as total_tours,tour_categories.category_name'))
            ->join('tour_categories','tour_categories.id','tours.category_id')
            ->groupBy('tours.category_id','tour_categories.category_name')
            ->get();
---
select `id`, `category_name` from `tour_categories` where `category_name` like 'Top Insider\'s Pick ' limit 1
select count(tours.id) as total_tours,tour_categories.category_name from `tours` inner join `tour_categories` on `tour_categories`.`id` = `tours`.`category_id` group by `tours`.`category_id`, `tour_categories`.`category_name`


        if($category=="all") {
            $categoryName = "All";
            $tours = Tour::with('category','tourImages')
                ->paginate('24');
---
select * from `tour_categories` where `tour_categories`.`id` in (1)
select * from `tours` where `category_id` = 1 limit 24 offset 0
select count(*) as aggregate from `tours` where `category_id` = 1