app/Http/Controllers/TourController.php

select * from `tours`
select * from `popular_destinations` where `status` = 1 order by `position` asc
---
    public function index() {

        $categories = Tour::select(DB::raw('count(tours.id) as total_tours,tour_categories.category_name'))
            ->join('tour_categories','tour_categories.id','tours.category_id')
            ->groupBy('tours.category_id','tour_categories.category_name')
            ->get();
        $tours = Tour::with('category','tourImages')
            ->get();
        $popularDestinations = PopularDestination::where('status',1)->orderBy('position','ASC')->get();